#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
[0m[1maws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:686430137309:cluster/ecs-cluster][0m

[0m[1m[32mNo changes.[0m[1m Your infrastructure matches the configuration.[0m

[0mTerraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
[0m[1mmodule.vpc_subnet_module.aws_eip.nat[1]: Refreshing state... [id=eipalloc-04685f5acf584a1e9][0m
[0m[1mmodule.vpc_subnet_module.aws_eip.nat[0]: Refreshing state... [id=eipalloc-03aba3723f9835a25][0m
[0m[1mmodule.vpc_subnet_module.aws_eip.nat[2]: Refreshing state... [id=eipalloc-0419ba9a4a4b72364][0m
[0m[1mmodule.vpc_subnet_module.aws_vpc.this[0]: Refreshing state... [id=vpc-0504b20795b36901c][0m
[0m[1mmodule.vpc_subnet_module.aws_subnet.public[1]: Refreshing state... [id=subnet-04de5cebdbb70256f][0m
[0m[1mmodule.vpc_subnet_module.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f6c01ca0c97f5fd7][0m
[0m[1mmodule.vpc_subnet_module.aws_route_table.public[0]: Refreshing state... [id=rtb-02bb84ed651881d9d][0m
[0m[1mmodule.vpc_subnet_module.aws_route_table.private[2]: Refreshing state... [id=rtb-021c4be79640c9cff][0m
[0m[1mmodule.vpc_subnet_module.aws_route_table.private[1]: Refreshing state... [id=rtb-0a2ad4275ccc8f570][0m
[0m[1mmodule.vpc_subnet_module.aws_route_table.private[0]: Refreshing state... [id=rtb-053ae5d05b2fe095b][0m
[0m[1mmodule.vpc_subnet_module.aws_subnet.private[1]: Refreshing state... [id=subnet-06f7d1b84c6ac9acb][0m
[0m[1mmodule.vpc_subnet_module.aws_subnet.public[2]: Refreshing state... [id=subnet-0e7217920d362ec6c][0m
[0m[1mmodule.vpc_subnet_module.aws_subnet.public[0]: Refreshing state... [id=subnet-0a6b11bfd9ef1ff3a][0m
[0m[1mmodule.vpc_subnet_module.aws_subnet.private[2]: Refreshing state... [id=subnet-0bfcb69e31055a212][0m
[0m[1mmodule.vpc_subnet_module.aws_subnet.private[0]: Refreshing state... [id=subnet-0b33cf62ea358d136][0m
[0m[1mmodule.vpc_subnet_module.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02bb84ed651881d9d1080289494][0m
[0m[1mmodule.vpc_subnet_module.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0620de718b62ecdfb][0m
[0m[1mmodule.vpc_subnet_module.aws_nat_gateway.this[1]: Refreshing state... [id=nat-03da667daf612852e][0m
[0m[1mmodule.vpc_subnet_module.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0242b9d6abda94d1e][0m
[0m[1mmodule.vpc_subnet_module.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-023695873340a563c][0m
[0m[1mmodule.vpc_subnet_module.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0804486adb345a212][0m
[0m[1mmodule.vpc_subnet_module.aws_nat_gateway.this[2]: Refreshing state... [id=nat-087464bd187267a52][0m
[0m[1mmodule.vpc_subnet_module.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-07201d99c7049b327][0m
[0m[1mmodule.vpc_subnet_module.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-09e2b1b0fdcaa7293][0m
[0m[1mmodule.vpc_subnet_module.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-023a738f2d4787fce][0m
[0m[1mmodule.vpc_subnet_module.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-053ae5d05b2fe095b1080289494][0m
[0m[1mmodule.vpc_subnet_module.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-021c4be79640c9cff1080289494][0m
[0m[1mmodule.vpc_subnet_module.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0a2ad4275ccc8f5701080289494][0m

[0m[1m[32mNo changes.[0m[1m Your infrastructure matches the configuration.[0m

[0mTerraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
[0m[1maws_efs_file_system.mysql_ecs: Refreshing state... [id=fs-0edca0619a007348f][0m
[0m[1maws_security_group.http: Refreshing state... [id=sg-0fe36a13bd9d14983][0m
[0m[1maws_security_group.egress_all: Refreshing state... [id=sg-00860b45520ac1c37][0m
[0m[1maws_efs_mount_target.alpha: Refreshing state... [id=fsmt-0e9a6b597fbc6c6db][0m
[0m[1maws_efs_access_point.access_point: Refreshing state... [id=fsap-01eb6f3f8a9aa5f5d][0m
[0m[1maws_alb.application_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:686430137309:loadbalancer/app/ghost-alb/d96cdba1c841b84f][0m

[0m[1m[32mNo changes.[0m[1m Your infrastructure matches the configuration.[0m

[0mTerraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

[0m[1m[32mNo changes.[0m[1m Your infrastructure matches the configuration.[0m

[0mTerraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
[0m[1maws_security_group.ingress_api: Refreshing state... [id=sg-081d20e484035bb69][0m
[0m[1mmodule.ecs_autoscale_role.data.aws_iam_policy_document.iam_policy_document: Reading...[0m[0m
[0m[1mmodule.ecs_task_execution_role.data.aws_iam_policy_document.iam_policy_document: Reading...[0m[0m
[0m[1mmodule.ecs_task_execution_role.data.aws_iam_policy.iam_policy: Reading...[0m[0m
[0m[1mmodule.ecs_autoscale_role.data.aws_iam_policy.iam_policy: Reading...[0m[0m
[0m[1mmodule.ecs_task_execution_role.data.aws_iam_policy_document.iam_policy_document: Read complete after 0s [id=320642683][0m
[0m[1mmodule.ecs_autoscale_role.data.aws_iam_policy_document.iam_policy_document: Read complete after 0s [id=3468681342][0m
[0m[1maws_lb_target_group.ghost_api: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:686430137309:targetgroup/ghost-api/f35eb27f92175fe2][0m
[0m[1mmodule.ecs_task_execution_role.aws_iam_role.iam_role: Refreshing state... [id=task-execution-role][0m
[0m[1mmodule.ecs_autoscale_role.aws_iam_role.iam_role: Refreshing state... [id=ecs-scale-application][0m
[0m[1maws_alb_listener.http_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:686430137309:listener/app/ghost-alb/d96cdba1c841b84f/ce3397ea6fff4617][0m
[0m[1maws_ecs_task_definition.ecs_task: Refreshing state... [id=mysql][0m
[0m[1maws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:us-east-1:686430137309:service/ecs-cluster/ecs_service][0m
[0m[1mmodule.ecs_task_execution_role.data.aws_iam_policy.iam_policy: Read complete after 1s [id=arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy][0m
[0m[1mmodule.ecs_task_execution_role.aws_iam_role_policy_attachment.iam_role_policy_attachment: Refreshing state... [id=task-execution-role-20221228180247128800000001][0m
[0m[1mmodule.ecs_autoscale_role.data.aws_iam_policy.iam_policy: Read complete after 1s [id=arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceAutoscaleRole][0m
[0m[1mmodule.ecs_autoscale_role.aws_iam_role_policy_attachment.iam_role_policy_attachment: Refreshing state... [id=ecs-scale-application-20221228180247148200000002][0m
[0m[1maws_appautoscaling_target.ecs_target: Refreshing state... [id=service/arn:aws:ecs:us-east-1:686430137309:cluster/ecs-cluster/ecs_service][0m
[0m[1maws_appautoscaling_policy.appautoscaling_policy_memory: Refreshing state... [id=application-scale-policy-memory][0m
[0m[1maws_appautoscaling_policy.appautoscaling_policy_cpu: Refreshing state... [id=application-scale-policy-cpu][0m
[0m
[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m

[0mTerraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # aws_ecs_service.ecs_service[0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "aws_ecs_service" "ecs_service" {
        [1m[0mid[0m[0m                                 = "arn:aws:ecs:us-east-1:686430137309:service/ecs-cluster/ecs_service"
      [31m-[0m [0m[1m[0mname[0m[0m                               = "ecs_service" [90m->[0m [0m[90mnull[0m[0m
        [1m[0mtags[0m[0m                               = {}
        [90m# (15 unchanged attributes hidden)[0m[0m

        [90m# (3 unchanged blocks hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
  [33m~[0m update in-place
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # aws_appautoscaling_target.ecs_target[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_appautoscaling_target" "ecs_target" {
        [1m[0mid[0m[0m                 = "service/arn:aws:ecs:us-east-1:686430137309:cluster/ecs-cluster/ecs_service"
      [33m~[0m [0m[1m[0mrole_arn[0m[0m           = "arn:aws:iam::686430137309:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" [33m->[0m [0m"arn:aws:iam::686430137309:role/ecs-scale-application"
        [90m# (5 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_ecs_service.ecs_service[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_ecs_service" "ecs_service" {
      [32m+[0m [0m[1m[0mcluster[0m[0m                            = "arn:aws:ecs:us-east-1:686430137309:cluster/ecs-cluster"
      [32m+[0m [0m[1m[0mdeployment_maximum_percent[0m[0m         = 200
      [32m+[0m [0m[1m[0mdeployment_minimum_healthy_percent[0m[0m = 100
      [32m+[0m [0m[1m[0mdesired_count[0m[0m                      = 1
      [32m+[0m [0m[1m[0menable_ecs_managed_tags[0m[0m            = false
      [32m+[0m [0m[1m[0menable_execute_command[0m[0m             = true
      [32m+[0m [0m[1m[0miam_role[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                 = (known after apply)
      [32m+[0m [0m[1m[0mlaunch_type[0m[0m                        = "FARGATE"
      [32m+[0m [0m[1m[0mname[0m[0m                               = "ecs_service"
      [32m+[0m [0m[1m[0mplatform_version[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mscheduling_strategy[0m[0m                = "REPLICA"
      [32m+[0m [0m[1m[0mtags_all[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mtask_definition[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mwait_for_steady_state[0m[0m              = false

      [32m+[0m [0mnetwork_configuration {
          [32m+[0m [0m[1m[0massign_public_ip[0m[0m = false
          [32m+[0m [0m[1m[0msecurity_groups[0m[0m  = [
              [32m+[0m [0m"sg-00860b45520ac1c37",
              [32m+[0m [0m"sg-081d20e484035bb69",
            ]
          [32m+[0m [0m[1m[0msubnets[0m[0m          = [
              [32m+[0m [0m"subnet-06f7d1b84c6ac9acb",
              [32m+[0m [0m"subnet-0b33cf62ea358d136",
              [32m+[0m [0m"subnet-0bfcb69e31055a212",
            ]
        }
    }

[1m  # aws_ecs_task_definition.ecs_task[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_ecs_task_definition" "ecs_task" {
      [33m~[0m [0m[1m[0marn[0m[0m                      = "arn:aws:ecs:us-east-1:686430137309:task-definition/mysql:8" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mcontainer_definitions[0m[0m    = jsonencode(
          [33m~[0m [0m[
              [33m~[0m [0m{
                    name         = "mysql"
                  [33m~[0m [0mportMappings = [
                      [33m~[0m [0m{
                          [31m-[0m [0mhostPort      = 3306 [90m->[0m [0m[90mnull[0m[0m
                          [31m-[0m [0mprotocol      = "tcp" [90m->[0m [0m[90mnull[0m[0m
                            [90m# (1 unchanged element hidden)[0m[0m
                        },
                    ]
                  [31m-[0m [0mvolumesFrom  = [] [90m->[0m [0m[90mnull[0m[0m
                    [90m# (6 unchanged elements hidden)[0m[0m
                },
            ]
        )
      [33m~[0m [0m[1m[0mid[0m[0m                       = "mysql" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mrevision[0m[0m                 = 8 [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mtags[0m[0m                     = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mtags_all[0m[0m                 = {} [33m->[0m [0m(known after apply)
        [90m# (8 unchanged attributes hidden)[0m[0m

      [31m-[0m [0mvolume { [31m# forces replacement[0m[0m
          [31m-[0m [0m[1m[0mname[0m[0m = "service-storage" [90m->[0m [0m[90mnull[0m[0m

          [31m-[0m [0mefs_volume_configuration {
              [31m-[0m [0m[1m[0mfile_system_id[0m[0m          = "fs-0edca0619a007348f" [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mroot_directory[0m[0m          = "/" [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mtransit_encryption[0m[0m      = "ENABLED" [90m->[0m [0m[90mnull[0m[0m
              [31m-[0m [0m[1m[0mtransit_encryption_port[0m[0m = 2999 [90m->[0m [0m[90mnull[0m[0m

              [31m-[0m [0mauthorization_config {
                  [31m-[0m [0m[1m[0maccess_point_id[0m[0m = "fsap-01eb6f3f8a9aa5f5d" [90m->[0m [0m[90mnull[0m[0m
                  [31m-[0m [0m[1m[0miam[0m[0m             = "DISABLED" [90m->[0m [0m[90mnull[0m[0m
                }
            }
        }
      [32m+[0m [0mvolume { [31m# forces replacement[0m[0m
          [32m+[0m [0m[1m[0mname[0m[0m = "service-storage"

          [32m+[0m [0mefs_volume_configuration {
              [32m+[0m [0m[1m[0mfile_system_id[0m[0m          = "fs-0edca0619a007348f"
              [32m+[0m [0m[1m[0mroot_directory[0m[0m          = "/opt/data"
              [32m+[0m [0m[1m[0mtransit_encryption[0m[0m      = "ENABLED"
              [32m+[0m [0m[1m[0mtransit_encryption_port[0m[0m = 2999

              [32m+[0m [0mauthorization_config {
                  [32m+[0m [0m[1m[0maccess_point_id[0m[0m = "fsap-01eb6f3f8a9aa5f5d"
                  [32m+[0m [0m[1m[0miam[0m[0m             = "DISABLED"
                }
            }
        }
    }

[0m[1mPlan:[0m 2 to add, 1 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @fhgrings, Action: `pull_request`*